historic/azure_g5_ssd_direct/randread-05-16k.fio.out
randread-16k: (g=0): rw=randread, bs=16K-16K/16K-16K/16K-16K, ioengine=libaio, iodepth=10
fio-2.1.3
Starting 1 process

randread-16k: (groupid=0, jobs=1): err= 0: pid=3885: Wed Apr  8 14:26:55 2015
  read : io=37057MB, bw=632434KB/s, iops=39527, runt= 60001msec
    slat (usec): min=2, max=3617, avg= 4.24, stdev= 4.15
    clat (usec): min=56, max=4214, avg=246.64, stdev=43.39
     lat (usec): min=81, max=4218, avg=251.50, stdev=43.57
    clat percentiles (usec):
     |  1.00th=[  183],  5.00th=[  197], 10.00th=[  205], 20.00th=[  215],
     | 30.00th=[  223], 40.00th=[  231], 50.00th=[  239], 60.00th=[  249],
     | 70.00th=[  262], 80.00th=[  274], 90.00th=[  298], 95.00th=[  318],
     | 99.00th=[  370], 99.50th=[  398], 99.90th=[  494], 99.95th=[  564],
     | 99.99th=[ 1224]
    bw (KB  /s): min=611040, max=642368, per=100.00%, avg=634178.67, stdev=4619.49
    lat (usec) : 100=0.01%, 250=60.68%, 500=39.23%, 750=0.07%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=4.68%, sys=29.87%, ctx=1198108, majf=0, minf=411
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=2371666/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=37057MB, aggrb=632433KB/s, minb=632433KB/s, maxb=632433KB/s, mint=60001msec, maxt=60001msec

Disk stats (read/write):
  sdb: ios=2362902/0, merge=0/0, ticks=563612/0, in_queue=563372, util=100.00%